Revit 2027 API
RebarInSystem.GetReinforcementRoundingManager Method
 Returns an object for managing reinforcement rounding override settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarRoundingManager GetReinforcementRoundingManager()
Public Function GetReinforcementRoundingManager As RebarRoundingManager
public:
RebarRoundingManager^ GetReinforcementRoundingManager()
member GetReinforcementRoundingManager : unit -> RebarRoundingManager
Return Value
RebarRoundingManager
 The rounding manager.
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace